Revit 2027 API
ParameterTypeId.SteelElemPlateWeight Property
 "Weight"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId SteelElemPlateWeight { get; }
Public Shared ReadOnly Property SteelElemPlateWeight As ForgeTypeId
	Get
public:
static property ForgeTypeId^ SteelElemPlateWeight {
	ForgeTypeId^ get ();
}
static member SteelElemPlateWeight : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace